//
//  TeamList.swift
//  SoccerInfo
//
//  Created by JD_MacMini on 2021/12/03.
//

import Foundation

struct LocalizationList {
    static let team: [Int : String] = [
        // Premier League
        33 : "맨유", 34 : "뉴캐슬", 38 : "왓포드", 39 : "울버햄튼", 40 : "리버풀",
        41 : "사우스햄튼", 42 : "아스날", 44 : "번리", 45 : "에버튼", 46 : "레스터",
        47 : "토트넘", 48 : "웨스트햄", 49 : "첼시", 50 : "맨시티", 51 : "브라이튼",
        52 : "크리스탈 팰리스", 55 : "브랜트포드", 63 : "리즈", 66 : "아스톤빌라", 71 : "노리치",
        
        // Laliga
        541 : "레알 마드리드", 536 : "세비야", 543 : "레알 베티스", 530 : "AT 마드리드", 548: "레알 소시에다드",
        728 : "라요 바예카노", 532 : "발렌시아", 529 : "바르셀로나", 540 : "에스파뇰", 727 : "오사수나",
        531 : "아틀레틱 클루브", 798 : "마요르카", 533 : "비야레알", 538 : "셀타비고", 715 : "그라나다",
        797 : "엘체", 542 : "알라베스", 724 : "카디스", 546 : "헤타페", 539 : "레반테",
        
        // Seria A
        505 : "인터", 489 : "AC 밀란", 499 : "아탈란타", 492 : "나폴리", 502 : "피오렌티나",
        497 : "AS 로마", 496 : "유벤투스", 511 : "엠폴리", 487 : "라치오", 500 : "볼로냐",
        504 : "베로나", 488 : "사수올로", 503 : "토리노", 498 : "삼프도리아", 494 : "우디네세",
        517 : "베네치아", 515 : "스페지아", 495 : "제노아", 490 : "칼리아리", 514 : "살레르니타나",
        
        // Bundesliga
        157 : "바이에른 뮌헨", 165 : "도르트문트", 168 : "레버쿠젠", 167 : "호펜하임", 160 : "프라이부르크",
        164 : "마인츠 05", 169 : "프랑크푸르트", 182 : "우니온 베를린", 173 : "라이프치히", 192 : "쾰른",
        161 : "볼프스부르크", 176 : "보훔", 163 : "묀헨글라트바흐", 159 : "헤르타 베를린", 172 : "슈투트가르트",
        170 : "아우크스부르크", 188 : "빌레펠트", 178 : "그로이터 퓌르트",
        
        
        // Ligue 1
        85 : "파리생제르망", 81 : "마르세유", 94 : "렌", 84 : "니스", 82 : "몽펠리에",
        116 : "랑스", 95 : "스트라스부르", 91 : "모나코", 77 : "앙제", 83 : "낭트",
        79 : "릴", 106 : "브레스투아", 80 : "리옹", 93 : "랭스", 78 : "보르도",
        99 : "클레르몽", 110 : "트루아", 112 : "메스", 97 : "로리앙", 1063 : "생테티안",
    ]
}
